arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/driverlib/setup.c
    if ( ui32Fcfg1Revision == 0 ) {
        // Use hardcoded trim values
        ui32TrimValue = 0x0068768A;
    } else {
        // Use device specific trim values located in factory configuration
        // area. All defined register bit fields have a corresponding trim
        // value in the factory configuration area
        ui32Fcfg1Value = HWREG(FCFG1_BASE + FCFG1_O_AMPCOMP_TH1);
        ui32TrimValue = (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_TH1_HPMRAMP3_LTH_M)>>
                            FCFG1_AMPCOMP_TH1_HPMRAMP3_LTH_S)<<
                         DDI_0_OSC_AMPCOMPTH1_HPMRAMP3_LTH_S);
        ui32TrimValue |= (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_TH1_HPMRAMP3_HTH_M)>>
                            FCFG1_AMPCOMP_TH1_HPMRAMP3_HTH_S)<<
                         DDI_0_OSC_AMPCOMPTH1_HPMRAMP3_HTH_S);
        ui32TrimValue |= (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_TH1_IBIASCAP_LPTOHP_OL_CNT_M)>>
                            FCFG1_AMPCOMP_TH1_IBIASCAP_LPTOHP_OL_CNT_S)<<
                         DDI_0_OSC_AMPCOMPTH1_IBIASCAP_LPTOHP_OL_CNT_S);
        ui32TrimValue |= (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_TH1_HPMRAMP1_TH_M)>>
                            FCFG1_AMPCOMP_TH1_HPMRAMP1_TH_S)<<
                         DDI_0_OSC_AMPCOMPTH1_HPMRAMP1_TH_S);
    }

    return(ui32TrimValue);
}

//*****************************************************************************
//
//! Returns the trim value to be used for the AMPCOMP_CTRL register in OSC_DIG
//
//*****************************************************************************
static uint32_t
GetTrimForAmpcompCtrl(uint32_t ui32Fcfg1Revision)
{
    uint32_t ui32TrimValue    ;
    uint32_t ui32Fcfg1Value   ;
    uint32_t ibiasOffset      ;
    uint32_t ibiasInit        ;
    uint32_t modeConf1        ;
    int32_t  deltaAdjust      ;

    if ( ui32Fcfg1Revision == 0 ) {
        // Use hardcoded trim values
        ui32TrimValue = 0x00713F27;
    } else {
        // Use device specific trim valuse loacted in factory configuration
        // area. Register bit fields without trim values in the factory
        // configuration area will be set to the value of 0.
        ui32Fcfg1Value = HWREG( FCFG1_BASE + FCFG1_O_AMPCOMP_CTRL1 );

        ibiasOffset    = ( ui32Fcfg1Value &
                           FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_M ) >>
                           FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_S ;
        ibiasInit      = ( ui32Fcfg1Value &
                           FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_M ) >>
                           FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_S ;

        if (( HWREG( CCFG_BASE + CCFG_O_SIZE_AND_DIS_FLAGS ) & CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR_M ) == 0 ) {
            // Adjust with DELTA_IBIAS_OFFSET and DELTA_IBIAS_INIT from CCFG
            modeConf1   = HWREG( CCFG_BASE + CCFG_O_MODE_CONF_1 );

            // Both fields are signed 4-bit values. This is an assumption when doing the sign extention.
            deltaAdjust = (int32_t)modeConf1 << ( 32 - CCFG_MODE_CONF_1_DELTA_IBIAS_OFFSET_S - 4 ) >> 28;
            deltaAdjust += (int32_t)ibiasOffset;
            if ( deltaAdjust < 0 ) {
               deltaAdjust = 0;
            }
            if ( deltaAdjust > ( DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_M >> DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_S )) {
                deltaAdjust  = ( DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_M >> DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_S );
            }
            ibiasOffset = (uint32_t)deltaAdjust;

            deltaAdjust = (int32_t)modeConf1 << ( 32 - CCFG_MODE_CONF_1_DELTA_IBIAS_INIT_S - 4 ) >> 28;
            deltaAdjust += (int32_t)ibiasInit;
            if ( deltaAdjust < 0 ) {
               deltaAdjust = 0;
            }
            if ( deltaAdjust > ( DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_M >> DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_S )) {
                deltaAdjust  = ( DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_M >> DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_S );
            }
            ibiasInit = (uint32_t)deltaAdjust;
        }
        ui32TrimValue = ( ibiasOffset << DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_S ) |
                        ( ibiasInit   << DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_S   ) ;

        ui32TrimValue |= (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_M)>>
                            FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_S)<<
                           DDI_0_OSC_AMPCOMPCTL_LPM_IBIAS_WAIT_CNT_FINAL_S);
        ui32TrimValue |= (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_CTRL1_CAP_STEP_M)>>
                            FCFG1_AMPCOMP_CTRL1_CAP_STEP_S)<<
                           DDI_0_OSC_AMPCOMPCTL_CAP_STEP_S);
        ui32TrimValue |= (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_M)>>
                            FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_S)<<
                           DDI_0_OSC_AMPCOMPCTL_IBIASCAP_HPTOLP_OL_CNT_S);

        if ( ui32Fcfg1Revision >= 0x00000022 ) {
            ui32TrimValue |= ((( ui32Fcfg1Value &
                FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE_M ) >>
                FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE_S ) <<
               DDI_0_OSC_AMPCOMPCTL_AMPCOMP_REQ_MODE_S );
        }
    }

    return(ui32TrimValue);
}

//*****************************************************************************
//
//! Returns the trim value from FCFG1 to be used as DBLR_LOOP_FILTER_RESET_VOLTAGE setting
//
//*****************************************************************************
static uint32_t
GetTrimForDblrLoopFilterResetVoltage( uint32_t ui32Fcfg1Revision )
{
   uint32_t dblrLoopFilterResetVoltageValue = 0; // Reset value

   if ( ui32Fcfg1Revision >= 0x00000020 ) {
      dblrLoopFilterResetVoltageValue = ( HWREG( FCFG1_BASE + FCFG1_O_MISC_OTP_DATA_1 ) &
         FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_M ) >>
         FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_S;
   }

